Repository: ben73-bit/MyWpfApp
Catalog: WpfMvvmApp/Properties/Resources.*.resx
Languages: it_it

# AddContractButton_Content
source: Add New Contract
it_it: Aggiungi Contratto

# RemoveContractButton_Content
source: Remove Selected
it_it: Rimuovi Selezionato

# SaveContractButton_Content
source: Save Contract
it_it: Salva Contratto

# ContractsTitle
source: Contracts
it_it: Contratti

# LessonsTitle
source: Lessons
it_it: Lezioni

# BillSelectedButton_Content
source: Bill Selected
it_it: Fattura Selezionate

# ImportIcsButton_Content
source: Import (.ics)
it_it: Importa (.ics)

# ExportIcsButton_Content
source: Export (.ics)
it_it: Esporta (.ics)

# LessonInput_StartLabel
source: Start:
it_it: Inizio:

# LessonInput_TimeSeparatorLabel
source: at
it_it: alle

# LessonInput_TimeToolTip
source: Start Time (HH:MM)
it_it: Ora Inizio (HH:MM)

# LessonInput_DurationLabel
source: Duration:
it_it: Durata:

# LessonInput_DurationToolTip
source: Duration (HH:MM)
it_it: Durata (HH:MM)

# LessonInput_SummaryLabel
source: Summary:
it_it: Oggetto:

# LessonInput_SummaryToolTip
source: Lesson Summary/Title
it_it: Oggetto/Titolo Lezione

# LessonList_DateHeader
source: Date
it_it: Data

# LessonList_StartHeader
source: Start
it_it: Inizio

# LessonList_DurationHeader
source: Duration
it_it: Durata

# LessonList_EndHeader
source: End
it_it: Fine

# LessonList_SummaryHeader
source: Summary
it_it: Oggetto

# LessonList_AmountHeader
source: Amount (â‚¬)
it_it: Importo (€)

# LessonList_ConfirmedHeader
source: Confirmed
it_it: Confermata

# LessonList_BilledHeader
source: Billed
it_it: Fatturata

# LessonList_InvoiceNumberHeader
source: Invoice #
it_it: Rif. Fattura

# LessonList_InvoiceDateHeader
source: Invoice Date
it_it: Data Fattura

# LessonList_ActionsHeader
source: Actions
it_it: Azioni

# LessonActions_EditButton_Content
source: Edit
it_it: Modifica

# LessonActions_RemoveButton_Content
source: Remove
it_it: Rimuovi

# LessonActions_CancelButton_Content
source: Cancel
it_it: Annulla

# Button_AddLesson
source: Add Lesson
it_it: Aggiungi Lezione

# Button_UpdateLesson
source: Update Lesson
it_it: Aggiorna Lezione

# Validation_FieldRequired
source: {0} is required.
it_it: Il campo '{0}' è obbligatorio.

# Validation_PositiveNumber
source: {0} must be positive.
it_it: Il campo '{0}' deve essere positivo.

# Validation_MinimumValue
source: {0} must be at least {1}.
it_it: Il campo '{0}' deve essere almeno {1}.

# Validation_CannotBeNegative
source: {0} cannot be negative.
it_it: Il campo '{0}' non può essere negativo.

# Validation_EndDateAfterStartDate
source: End date must be after start date.
it_it: La data di fine deve essere successiva alla data di inizio.

# Validation_TimeSpanPositive
source: {0} must be positive.
it_it: Il campo '{0}' deve essere positivo.

# MsgBox_Title_ConfirmRemoval
source: Confirm Removal
it_it: Conferma Rimozione

# MsgBox_Title_ConfirmContractDeletion
source: Confirm Contract Deletion
it_it: Conferma Eliminazione Contratto

# MsgBox_Title_NoContractSelected
source: No Contract Selected
it_it: Nessun Contratto Selezionato

# MsgBox_Title_ImportResult
source: Import Result
it_it: Risultato Importazione

# MsgBox_Title_ImportComplete
source: Import Complete
it_it: Importazione Completata

# MsgBox_Title_ImportError
source: Import Error
it_it: Errore di Importazione

# MsgBox_Title_Export
source: Export
it_it: Esportazione

# MsgBox_Title_ExportComplete
source: Export Complete
it_it: Esportazione Completata

# MsgBox_Title_ExportError
source: Export Error
it_it: Errore di Esportazione

# MsgBox_Title_Billing
source: Billing
it_it: Fatturazione

# MsgBox_Title_BillingComplete
source: Billing Complete
it_it: Fatturazione Completata

# MsgBox_Title_ValidationError
source: Validation Error
it_it: Errore di Validazione

# MsgBox_Title_InternalError
source: Internal Error
it_it: Errore Interno

# MsgBox_Title_SaveError
source: Save Error
it_it: Errore Salvataggio

# MsgBox_Title_SaveContract
source: Save Contract
it_it: Salva Contratto

# MsgBox_ConfirmRemoveLesson_Text
source: Remove lesson starting {0:g}?
it_it: Rimuovere la lezione del {0:g}?

# MsgBox_ConfirmRemoveSelectedLesson_Text_Singular
source: Remove selected lesson?
it_it: Rimuovere la lezione selezionata?

# MsgBox_ConfirmRemoveSelectedLessons_Text_Plural
source: Remove {0} selected lessons?
it_it: Rimuovere le {0} lezioni selezionate?

# MsgBox_ConfirmContractDeletion_Text
source: Are you sure you want to delete the contract '{0} - {1}'?\nThis will also delete all associated lessons.
it_it: Sei sicuro di voler eliminare il contratto '{0} - {1}'?\nQuesto eliminerà anche tutte le lezioni associate.

# MsgBox_SelectContractBeforeImport_Text
source: Please select a contract before importing lessons.
it_it: Selezionare un contratto prima di importare le lezioni.

# MsgBox_NoLessonsToImport_Text
source: No valid lesson events found in the selected file.
it_it: Nessun evento lezione valido trovato nel file selezionato.

# MsgBox_ImportSuccessful_Text
source: {0} lessons imported successfully.
it_it: {0} lezioni importate con successo.

# MsgBox_ImportError_Text
source: An error occurred while importing the file:\n{0}
it_it: Si è verificato un errore durante l'importazione del file:\n{0}

# MsgBox_SelectContractBeforeExport_Text
source: Please select a contract to export its lessons.
it_it: Selezionare un contratto per esportare le relative lezioni.

# MsgBox_NoLessonsToExport_Text
source: There are no lessons to export for this contract.
it_it: Non ci sono lezioni da esportare per questo contratto.

# MsgBox_ExportSuccessful_Text
source: Lessons exported successfully to:\n{0}
it_it: Lezioni esportate con successo in:\n{0}

# MsgBox_ExportError_Text
source: An error occurred during export.
it_it: Si è verificato un errore durante l'esportazione.

# MsgBox_ExportFileError_Text
source: An error occurred while exporting the file:\n{0}
it_it: Si è verificato un errore durante l'esportazione del file:\n{0}

# MsgBox_NoLessonsToBill_Text
source: No confirmed, unbilled lessons selected.
it_it: Nessuna lezione confermata e non fatturata selezionata.

# MsgBox_InvoiceNumberEmpty_Text
source: Invoice number cannot be empty.
it_it: Il numero di fattura non può essere vuoto.

# MsgBox_InvoiceDateNotSelected_Text
source: Please select an invoice date.
it_it: Selezionare una data per la fattura.

# MsgBox_InvoiceDateError_Text
source: Invoice date was not correctly selected.
it_it: Data fattura non selezionata correttamente.

# MsgBox_BillingSuccessful_Text
source: {0} lessons marked as billed with Invoice # {1} dated {2:d}.
it_it: {0} lezioni contrassegnate come fatturate con Fattura n. {1} del {2:d}.

# MsgBox_SaveError_Text
source: Could not save user data. Please check permissions or disk space.
it_it: Impossibile salvare i dati utente. Verificare i permessi o lo spazio su disco.

# MsgBox_SaveErrorUnknown_Text
source: Could not save user data. An unknown error occurred.
it_it: Impossibile salvare i dati utente. Si è verificato un errore sconosciuto.

# MsgBox_SaveErrorCritical_Text
source: An unexpected error occurred while trying to save data:\n{0}
it_it: Si è verificato un errore imprevisto durante il tentativo di salvare i dati:\n{0}

# MsgBox_SaveContractNoted_Text
source: Contract '{0}' changes noted (will be saved on exit or via Save All).
it_it: Modifiche al contratto '{0}' annotate (verranno salvate all'uscita o con Salva Tutto).

# Validation_InvalidTimeFormat
source: Invalid Start Time format (use HH:MM).
it_it: Formato Ora Inizio non valido (usare HH:MM).

# ContractDetails_Header
source: Contract Details
it_it: Dettagli Contratto

# ContractDetails_CompanyLabel
source: Company:
it_it: Azienda:

# ContractDetails_NumberLabel
source: Contract Number:
it_it: Numero Contratto:

# ContractDetails_RateLabel
source: Hourly Rate (â‚¬):
it_it: Tariffa Oraria (€):

# ContractDetails_TotalHoursLabel
source: Total Contract Hours:
it_it: Ore Totali Contratto:

# ContractDetails_BilledHoursLabel
source: Billed Hours:
it_it: Ore Fatturate:

# ContractDetails_StartDateLabel
source: Start Date:
it_it: Data Inizio:

# ContractDetails_EndDateLabel
source: End Date:
it_it: Data Fine:

# SummaryBox_Title
source: Summary
it_it: Riepilogo

# SummaryBox_HoursTitle
source: Hours
it_it: Ore

# SummaryBox_InsertedLabel
source: Inserted:
it_it: Inserite:

# SummaryBox_ConfirmedLabel
source: Confirmed:
it_it: Confermate:

# SummaryBox_BilledLabel
source: Billed:
it_it: Fatturate:

# SummaryBox_AmountsTitle
source: Amounts (â‚¬)
it_it: Importi (€)

# SummaryBox_PotentialLabel
source: Potential Total:
it_it: Potenziale Totale:

# SummaryBox_ReadyToBillLabel
source: Ready to Bill:
it_it: Da Fatturare:

# SummaryBox_AlreadyBilledLabel
source: Already Billed:
it_it: Già Fatturato:

# SummaryBox_RemainingHoursLabel
source: Remaining Contract Hours:
it_it: Ore Residue Contratto:

# ContractList_CompanyHeader
source: Company
it_it: Azienda

# ContractList_NumberHeader
source: Contract Number
it_it: Numero Contratto
